app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.all.order(created_at: :desc)